Revit 2026 API

# FamilyThermalProperties Methods

---

The FamilyThermalProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Find | Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Confirms that the thermal properties are correctly set for assignment to a FamilySymbol. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FamilyThermalProperties Class

Autodesk.Revit.DB Namespace